//
//  FontKeyoboardModel.swift
//  MyFonts
//
//  Created by Irakli on 1/22/20.
//  Copyright © 2020 Irakli. All rights reserved.
//

import Foundation

struct FontKeyboard {
    struct ViewModel {
        struct UserKeyboard {
            var title: String
            var characters: [[String]]
            var upperCharacters: [[String]]?
            var id: Int
        }
        
        static let keyboards: [UserKeyboard] = [
            UserKeyboard(title: "Standard",
                         
                         characters: [["q", "w", "e", "r", "t", "y", "u", "i", "o", "p"],
                                      ["a", "s", "d", "f", "g", "h", "j", "k", "l"],
                                      ["z", "x", "c", "v", "b", "n", "m"]],
                         id: 0),
            UserKeyboard(title: "Emoji",
                         characters: [["𓂸","𓂺","𓂀","✞","シ","㋛","ଈ","♡"],
                                      ["ꨄ","𓄁","𓃠","𓆉","𓅿","𐂃","𖠌","⚣"],
                                      ["𓃰","𓃟","𓆏","𓂉","☻"]],
                         id: 1),
            UserKeyboard(title: "𝚃𝚢𝚙𝚎𝚠𝚛𝚒𝚝𝚎𝚛",
                         characters: [["𝚚","𝚠","𝚎","𝚛","𝚝","𝚢","𝚞","𝚒","𝚘","𝚙"],
                                      ["𝚊","𝚜","𝚍","𝚏","𝚐","𝚑","𝚓","𝚔","𝚕"],
                                      ["𝚣","𝚡","𝚌","𝚟","𝚋","𝚗","𝚖"]],
                         upperCharacters: [["𝚀","𝚆","𝙴","𝚁","𝚃","𝚈","𝚄","𝙸","𝙾","𝙿"],
                                           ["𝙰","𝚂","𝙳","𝙵","𝙶","𝙷","𝙹","𝙺","𝙻"],
                                           ["𝚉","𝚇","𝙲","𝚅","𝙱","𝙽","𝙼"]],
                         
                         id: 2),
            UserKeyboard(title: "𝕆𝕦𝕥𝕝𝕚𝕟𝕖",
                         characters: [["𝕢","𝕨","𝕖","𝕣","𝕥","𝕪","𝕦","𝕚","𝕠","𝕡"],
                                      ["𝕒","𝕤","𝕕","𝕗","𝕘","𝕙","𝕛","𝕜","𝕝"],
                                      ["𝕫","𝕩","𝕔","𝕧","𝕓","𝕟","𝕞"]],
                         upperCharacters: [["ℚ","𝕎","𝔼","ℝ","𝕋","𝕐","𝕌","𝕀","𝕆","ℙ"],
                                           ["𝔸","𝕊","𝔻","𝔽","𝔾","ℍ","𝕁","𝕂","𝕃"],
                                           ["ℤ","𝕏","ℂ","𝕍","𝔹","ℕ","𝕄"]],
                         
                         id: 3),
            UserKeyboard(title: "𝒮𝒸𝓋𝒾𝓅𝓉",
                         characters: [["𝓆","𝓌","ℯ","𝓇","𝓉","𝓎","𝓊","𝒾","ℴ","𝓅"],
                                      ["𝒶","𝓈","𝒹","𝒻","ℊ","𝒽","𝒿","𝓀","𝓁"],
                                      ["𝓏","𝓍","𝒸","𝓋","𝒷","𝓃","𝓂"]],
                         id: 4),
            UserKeyboard(title: "Tɪɴʏ Cᴀᴘs",
                         characters: [["ǫ","ᴡ","ᴇ","ʀ","ᴛ","ʏ","ᴜ","ɪ","ᴏ","ᴘ"],
                                      ["ᴀ","s","ᴅ","ғ","ɢ","ʜ","ᴊ","ᴋ","ʟ"],
                                      ["ᴢ","x","ᴄ","ᴠ","ʙ","ɴ","ᴍ"]],
                         id: 5),
            UserKeyboard(title: "𝐒𝐞𝐫𝐢𝐟",
                         characters: [["𝐪","𝐰","𝐞","𝐫","𝐭","𝐲","𝐮","𝐢","𝐨","𝐩"],
                                      ["𝐚","𝐬","𝐝","𝐟","𝐠","𝐡","𝐣","𝐤","𝐥"],
                                      ["𝐳","𝐱","𝐜","𝐯","𝐛","𝐧","𝐦"]],
                         upperCharacters: [["𝐐","𝐖","𝐄","𝐑","𝐓","𝐘","𝐔","𝐈","𝐎","𝐏"],
                                           ["𝐀","𝐒","𝐃","𝐅","𝐆","𝐇","𝐉","𝐊","𝐋"],
                                           ["𝐙","𝐗","𝐂","𝐕","𝐁","𝐍","𝐌"]],
                         id: 6),
            UserKeyboard(title: "𝑆𝑒𝑟𝑖𝑓",
                         characters: [["𝑞","𝑤","𝑒","𝑟","𝑡","𝑦","𝑢","𝑖","𝑜","𝑝"],
                                      ["𝑎","𝑠","𝑑","𝑓","𝑔","ℎ","𝑗","𝑘","𝑙"],
                                      ["𝑧","𝑥","𝑐","𝑣","𝑏","𝑛","𝑚"]],
                         upperCharacters: [["𝑄","𝑊","𝐸","𝑅","𝑇","𝑌","𝑈","𝐼","𝑂","𝑃"],
                                           ["𝐴","𝑆","𝐷","𝐹","𝐺","𝐻","𝐽","𝐾","𝐿"],
                                           ["𝑍","𝑋","𝐶","𝑉","𝐵","𝑁","𝑀"]],
                         
                         
                         id: 7),
            UserKeyboard(title: "𝑺𝒆𝒓𝒊𝒇",
                         characters: [["𝒒","𝒘","𝒆","𝒓","𝒕","𝒚","𝒖","𝒊","𝒐","𝒑"],
                                      ["𝒂","𝒔","𝒅","𝒇","𝒈","𝒉","𝒋","𝒌","𝒍"],
                                      ["𝒛","𝒙","𝒄","𝒗","𝒃","𝒏","𝒎"]],
                         upperCharacters: [["𝑸","𝑾","𝑬","𝑹","𝑻","𝒀","𝑼","𝑰","𝑶","𝑷"],
                                           ["𝑨","𝑺","𝑫","𝑭","𝑮","𝑯","𝑱","𝑲","𝑳"],
                                           ["𝒁","𝑿","𝑪","𝑽","𝑩","𝑵","𝑴"]],
                         
                         id: 8),
            UserKeyboard(title: "𝖲𝖺𝗇𝗌",
                         characters: [["𝗊","𝗐","𝖾","𝗋","𝗍","𝗒","𝗎","𝗂","𝗈","𝗉"],
                                      ["𝖺","𝗌","𝖽","𝖿","𝗀","𝗁","𝗃","𝗄","𝗅"],
                                      ["𝗓","𝗑","𝖼","𝗏","𝖻","𝗇","𝗆"]],
                         upperCharacters:[["𝖰","𝖶","𝖤","𝖱","𝖳","𝖸","𝖴","𝖨","𝖮","𝖯"],
                                          ["𝖠","𝖲","𝖣","𝖥","𝖦","𝖧","𝖩","𝖪","𝖫"],
                                          ["𝖹","𝖷","𝖢","𝖵","𝖡","𝖭","𝖬"]],
                         
                         id: 9),
            
            UserKeyboard(title: "𝗦𝗮𝗻𝘀",
                         characters: [["𝗾","𝘄","𝗲","𝗿","𝘁","𝘆","𝘂","𝗶","𝗼","𝗽"],
                                      ["𝗮","𝘀","𝗱","𝗳","𝗴","𝗵","𝗷","𝗸","𝗹"],
                                      ["𝘇","𝘅","𝗰","𝘃","𝗯","𝗻","𝗺"]],
                         upperCharacters: [["𝗤","𝗪","𝗘","𝗥","𝗧","𝗬","𝗨","𝗜","𝗢","𝗣"],
                                           ["𝗔","𝗦","𝗗","𝗙","𝗚","𝗛","𝗝","𝗞","𝗟"],
                                           ["𝗭","𝗫","𝗖","𝗩","𝗕","𝗡","𝗠"]],
                         id: 10),
            
            UserKeyboard(title: "𝘚𝘢𝘯𝘴",
                         characters: [["𝘲","𝘸","𝘦","𝘳","𝘵","𝘺","𝘶","𝘪","𝘰","𝘱"],
                                      ["𝘢","𝘴","𝘥","𝘧","𝘨","𝘩","𝘫","𝘬","𝘭"],
                                      ["𝘻","𝘹","𝘤","𝘷","𝘣","𝘯","𝘮"]],
                         upperCharacters: [["𝘘","𝘞","𝘌","𝘙","𝘛","𝘠","𝘜","𝘐","𝘖","𝘗"],
                                           ["𝘈","𝘚","𝘋","𝘍","𝘎","𝘏","𝘑","𝘒","𝘓"],
                                           ["𝘡","𝘟","𝘊","𝘝","𝘉","𝘕","𝘔"]],
                         
                         
                         id: 11),
            UserKeyboard(title: "𝙎𝙖𝙣𝙨",
                         characters: [["𝙦","𝙬","𝙚","𝙧","𝙩","𝙮","𝙪","𝙞","𝙤","𝙥"],
                                      ["𝙖","𝙨","𝙙","𝙛","𝙜","𝙝","𝙟","𝙠","𝙡"],
                                      ["𝙯","𝙭","𝙘","𝙫","𝙗","𝙣","𝙢"]],
                         upperCharacters: [["𝙌","𝙒","𝙀","𝙍","𝙏","𝙔","𝙐","𝙄","𝙊","𝙋"],
                                           ["𝘼","𝙎","𝘿","𝙁","𝙂","𝙃","𝙅","𝙆","𝙇"],
                                           ["𝙕","𝙓","𝘾","𝙑","𝘽","𝙉","𝙈"]],
                         
                         id: 12),
            UserKeyboard(title: "𝙀𝙢𝙤𝙟𝙞 𝙀𝙜𝙮𝙥𝙩𝙞𝙖𝙣",
                         characters: [["𓀀","𓀁","𓀂","𓀃","𓀄","𓀅","𓀆","𓀌","𓀏","𓀒"],
                                      ["𓀔","𓀗","𓀛","𓀟","𓀡","𓀩","𓀬","𓀭","𓁃","𓁉"],
                                      ["𓁠","𓁢","𓁨","𓁩","𓁶","𓁷","𓁲"]],
                         id: 13),
            UserKeyboard(title: "𝙀𝙢𝙤𝙟𝙞 animal",
                         characters: [["𓃒","𓃓","𓃔","𓃗","𓃘","𓃙","𓃚","𓃞","𓃠","𓃢","𓃭"],
                                      ["𓃯","𓃰","𓃱","𓃲","𓃵","𓃸","𓃺","𓃻","𓃾","𓄀"],
                                      ["𓄁","𓄂","𓄃","𓄅","𓄇","𓅃","𓅰","𓅿"]],
                         id: 14),
            UserKeyboard(title: "𝙀𝙢𝙤𝙟𝙞 Symbol",
                         characters: [["᪥","✯","𖣔","𖧷","߷","༆","༄","Ꙭ","⁂","⌘"],
                                      ["☼","۞","⍟","𖣘","𓇽","𖦹","❁","᯾"],
                                      ["★","☆","✫","✰","᯽","✪","𒊹"]],
                         id: 15),
            UserKeyboard(title: "ƒσηт",
                         characters: [["۹","ω","є","я","т","у","υ","ι","σ","ρ"],
                                      ["α","ѕ","∂","ƒ","ﻭ","н","נ","к","ℓ"],
                                      ["չ","χ","¢","ν","в","η","м"]],
                         id: 16),
            UserKeyboard(title: "ቻዐክፕ",
                         characters: [["ዒ","ሠ","ቿ","ዪ","ፕ","ሃ","ሁ","ጎ","ዐ","የ"],
                                      ["ል","ነ","ዕ","ቻ","ኗ","ዘ","ክ","ጕ","ረ","]"],
                                      ["ጊ","ሸ","ር","ሀ","ጌ","ክ","ጠ"]],
                         id: 17),
            UserKeyboard(title: "Ḟöṅẗ",
                         characters: [["q","ẅ","ë","ṛ","ẗ","ÿ","ü","ï","ö","ṗ"], //todo change q
                            ["ä","ṡ","ḋ","ḟ","ġ","ḧ","j","ḳ","ḷ"],
                            ["ż","ẍ","ċ","ṿ","ḅ","ṅ","ṁ"]],
                         id: 18),
            UserKeyboard(title: "ϯαϯσσ",
                         characters: [["զ","ϖ","ε","ɾ","ϯ","ψ","մ","ί","σ","թ"],
                                      ["α","ς","δ","ƒ","ɡ","հ","յ","ƙ","ʆ"],
                                      ["Հ","x","ɕ","ѵ","ɓ","η","ʍ"]],
                         upperCharacters: [["Q","Ẅ","Ë","Ṛ","T̈","Ÿ","Ü","Ï","Ö","Ṗ"],
                                           ["Ä","Ṡ","Ḋ","Ḟ","Ġ","Ḧ","J̈","K̈","Ḷ"],
                                           ["Ż","Ẍ","Ċ","Ṿ","Ḅ","N̈","M̈"]],
                         
                         id: 19),
            UserKeyboard(title: "🅂🅀🅄🄰🅁🄴🄳",
                         characters: [["🅀","🅆","🄴","🅁","🅃","🅈","🅄","🄸","🄾","🄿"],
                                      ["🄰","🅂","🄳","🄵","🄶","🄷","🄹","🄺","🄻"],
                                      ["🅉","🅇","🄲","🅅","🄱","🄽","🄼"]],
                         id: 20)
        ]
    }
}

